       IDENTIFICATION DIVISION.
       PROGRAM-ID. VRCB0120.

       ENVIRONMENT DIVISION.

       INPUT-OUTPUT SECTION.

       FILE-CONTROL.

           SELECT SEQUENCE-FILE
               ASSIGN TO "test-data/VRSEQM.dat"
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS SEQUENCE-TYPE
               FILE STATUS IS WS-FILE-STATUS.

       DATA DIVISION.

       FILE SECTION.

       FD  SEQUENCE-FILE.

       COPY VRCP9004.

       WORKING-STORAGE SECTION.

       01 WS-FILE-STATUS              PIC XX.

       LINKAGE SECTION.

       01 LK-SEQUENCE-TYPE            PIC X(10).

       01 LK-GENERATED-NUMBER         PIC 9(10).

       PROCEDURE DIVISION
           USING LK-SEQUENCE-TYPE
                 LK-GENERATED-NUMBER.

       1000-MAIN.

           OPEN I-O SEQUENCE-FILE

           PERFORM 2000-READ-SEQUENCE

           PERFORM 3000-INCREMENT-SEQUENCE

           PERFORM 4000-UPDATE-SEQUENCE

           CLOSE SEQUENCE-FILE

           GOBACK.

       2000-READ-SEQUENCE.

      * READ SEQUENCE RECORD

       3000-INCREMENT-SEQUENCE.

      * MOVE CURRENT VALUE

      * ADD 1

      * RETURN GENERATED VALUE

       4000-UPDATE-SEQUENCE.

      * REWRITE UPDATED RECORD