       IDENTIFICATION DIVISION.
       PROGRAM-ID. VRCUSTM-INIT.

       ENVIRONMENT DIVISION.

       INPUT-OUTPUT SECTION.

       FILE-CONTROL.

           SELECT CUSTOMER-FILE
               ASSIGN TO "test-data/VRCUSTM.dat"
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS FD-CUSTOMER-ID
               FILE STATUS IS WS-FILE-STATUS.

       DATA DIVISION.

       FILE SECTION.

       FD CUSTOMER-FILE.

       COPY VRCP0101
           REPLACING
               CP-CUSTOMER-RECORD BY FD-CUSTOMER-RECORD
               CP-CUSTOMER-IDENTITY BY FD-CUSTOMER-IDENTITY
               CP-CUSTOMER-ID BY FD-CUSTOMER-ID
               CP-CUSTOMER-TYPE BY FD-CUSTOMER-TYPE
               CP-CUSTOMER-TITLE BY FD-CUSTOMER-TITLE
               CP-CUSTOMER-FIRST-NAME BY FD-CUSTOMER-FIRST-NAME
               CP-CUSTOMER-MIDDLE-NAME BY FD-CUSTOMER-MIDDLE-NAME
               CP-CUSTOMER-LAST-NAME BY FD-CUSTOMER-LAST-NAME
               CP-CUSTOMER-GENDER BY FD-CUSTOMER-GENDER
               CP-CUSTOMER-DATE-OF-BIRTH BY FD-CUSTOMER-DATE-OF-BIRTH
               CP-CUSTOMER-CONTACT BY FD-CUSTOMER-CONTACT
               CP-CUSTOMER-MOBILE-NUMBER BY FD-CUSTOMER-MOBILE-NUMBER
               CP-CUSTOMER-EMAIL-ID BY FD-CUSTOMER-EMAIL-ID
               CP-CUSTOMER-ADDRESS BY FD-CUSTOMER-ADDRESS
               CP-CUSTOMER-ADDRESS-LINE-1 BY FD-CUSTOMER-ADDRESS-LINE-1
               CP-CUSTOMER-ADDRESS-LINE-2 BY FD-CUSTOMER-ADDRESS-LINE-2
               CP-CUSTOMER-CITY BY FD-CUSTOMER-CITY
               CP-CUSTOMER-STATE BY FD-CUSTOMER-STATE
               CP-CUSTOMER-PINCODE BY FD-CUSTOMER-PINCODE
               CP-CUSTOMER-COUNTRY BY FD-CUSTOMER-COUNTRY
               CP-CUSTOMER-BANK BY FD-CUSTOMER-BANK
               CP-CUSTOMER-HOME-BRANCH BY FD-CUSTOMER-HOME-BRANCH
               CP-CUSTOMER-STATUS BY FD-CUSTOMER-STATUS
               CP-CUSTOMER-ACTIVE BY FD-CUSTOMER-ACTIVE
               CP-CUSTOMER-INACTIVE BY FD-CUSTOMER-INACTIVE
               CP-CUSTOMER-DORMANT BY FD-CUSTOMER-DORMANT
               CP-CUSTOMER-BLOCKED BY FD-CUSTOMER-BLOCKED
               CP-CUSTOMER-CLOSED BY FD-CUSTOMER-CLOSED
               CP-CUSTOMER-AUDIT BY FD-CUSTOMER-AUDIT
               CP-CUSTOMER-CREATED-DATE BY FD-CUSTOMER-CREATED-DATE
               CP-CUSTOMER-CREATED-BY BY FD-CUSTOMER-CREATED-BY
               CP-CUSTOMER-LAST-UPD-DATE BY FD-CUSTOMER-LAST-UPD-DATE
               CP-CUSTOMER-LAST-UPD-BY BY FD-CUSTOMER-LAST-UPD-BY.

       WORKING-STORAGE SECTION.

       01 WS-FILE-STATUS              PIC XX.

       PROCEDURE DIVISION.

           OPEN OUTPUT CUSTOMER-FILE

           DISPLAY "CUSTOMER FILE STATUS : "
                   WS-FILE-STATUS

           CLOSE CUSTOMER-FILE

           GOBACK.
