       01 VRCB0100-COMMAREA.
        05 VRCB0100-CUSTOMER-RECORD.
         10 VRCB0100-CUSTOMER-IDENTITY.
          15 VRCB0100-CUSTOMER-ID PIC X(10) USAGE DISPLAY.
          15 VRCB0100-CUSTOMER-TYPE PIC X(2) USAGE DISPLAY.
          15 VRCB0100-CUSTOMER-TITLE PIC X(5) USAGE DISPLAY.
          15 VRCB0100-CUSTOMER-FIRST-NAME PIC X(30) USAGE DISPLAY.
          15 VRCB0100-CUSTOMER-MIDDLE-NAME PIC X(30) USAGE DISPLAY.
          15 VRCB0100-CUSTOMER-LAST-NAME PIC X(30) USAGE DISPLAY.
          15 VRCB0100-CUSTOMER-GENDER PIC X USAGE DISPLAY.
          15 VRCB0100-CUSTOMER-DATE-OF-BIRT PIC X(10) USAGE DISPLAY.
         10 VRCB0100-CUSTOMER-CONTACT.
          15 VRCB0100-CUSTOMER-MOBILE-NUMBE PIC X(10) USAGE DISPLAY.
          15 VRCB0100-CUSTOMER-EMAIL-ID PIC X(60) USAGE DISPLAY.
         10 VRCB0100-CUSTOMER-ADDRESS.
          15 VRCB0100-CUSTOMER-ADDRESS-LINE PIC X(50) USAGE DISPLAY.
          15 VRCB0100-CUSTOMER-ADDRESS-LINE PIC X(50) USAGE DISPLAY.
          15 VRCB0100-CUSTOMER-CITY PIC X(30) USAGE DISPLAY.
          15 VRCB0100-CUSTOMER-STATE PIC X(30) USAGE DISPLAY.
          15 VRCB0100-CUSTOMER-PINCODE PIC X(6) USAGE DISPLAY.
          15 VRCB0100-CUSTOMER-COUNTRY PIC X(30) USAGE DISPLAY.
         10 VRCB0100-CUSTOMER-BANK.
          15 VRCB0100-CUSTOMER-HOME-BRANCH PIC X(4) USAGE DISPLAY.
          15 VRCB0100-CUSTOMER-STATUS PIC X USAGE DISPLAY.
         10 VRCB0100-CUSTOMER-AUDIT.
          15 VRCB0100-CUSTOMER-CREATED-DATE PIC X(10) USAGE DISPLAY.
          15 VRCB0100-CUSTOMER-CREATED-BY PIC X(8) USAGE DISPLAY.
          15 VRCB0100-CUSTOMER-LAST-UPD-DAT PIC X(10) USAGE DISPLAY.
          15 VRCB0100-CUSTOMER-LAST-UPD-BY PIC X(8) USAGE DISPLAY.
        05 VRCB0100-OPERATION-RESULT.
         10 VRCB0100-RETURN-CODE PIC 9(2) USAGE DISPLAY.
         10 VRCB0100-SEVERITY PIC X USAGE DISPLAY.
         10 VRCB0100-ERROR-CODE PIC X(12) USAGE DISPLAY.
         10 VRCB0100-RETURN-MESSAGE PIC X(50) USAGE DISPLAY.
